OdDAI.ConstIterator.type
\details
Retrieves the current element type.
\returns The current element type represented with an OdRxValueType object.

OdDAI.ConstIterator.testCurrentMember
\details
Tests the current element the iterator refers.
\returns true if the current element is correct; otherwise, the method returns false.

OdDAI.ConstIterator.getValueBound
\details
Retrieves the value bound.
\returns A signed integer that contains the value bound.

OdDAI.ConstIterator.getCurrentMember
\details
Retrieves the current element (the element of the collection the iterator refers).
\returns The current element represented with an OdRxValue object.

OdDAI.ConstIterator.end
\details
Move the iterator object to the last element.

OdDAI.ConstIterator.previous
\details
Move the iterator object to the previous element.
\returns true if the previous element exists and the iterator was moved to it; otherwise, the method returns false.

OdDAI.ConstIterator.next
\details
Move the iterator object to the next element.
\returns true if the next element exists and the iterator was moved to it; otherwise, the method returns false.

OdDAI.ConstIterator.beginning
\details
Move the iterator object to the first element.

OdDAI.ConstIterator.Dispose
\details
Destroys the constant iterator object.